Revit 2024 API
Document.GetPrintSettingIds Method
 Retrieves all Print Settings of current project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ICollection<ElementId> GetPrintSettingIds()
Visual Basic
Public Function GetPrintSettingIds As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetPrintSettingIds()
Return Value
The ElementIds of all print setting elements
See Also
Document Class
Autodesk.Revit.DB Namespace